title: Multiple Failed Login Attempts

id: 11111111-1111-1111-1111-111111111111

status: experimental

description: Detects failed login attempts on Windows systems

author: Mahi Surani

logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4625

  condition: selection

level: medium

tags:
  - attack.credential_access
  - attack.t1110