title: Scheduled Task Creation Detection

id: 33333333-3333-3333-3333-333333333333

status: experimental

description: Detects creation of scheduled tasks

logsource:
  product: windows
  service: security

detection:
  selection:
    EventID: 4698

  condition: selection

level: medium

tags:
  - attack.persistence
  - attack.t1053